/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   parse.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: lseema <lseema@student.21-school.ru>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/01/02 13:40:04 by lseema            #+#    #+#             */
/*   Updated: 2021/01/02 14:58:22 by lseema           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "corewar.h"

int		parse_args(int argc, char **argv, t_corewar **corewar)
{
	if (argc && *argv && corewar)
	{
		//заглушка
	}
	return (1);
}
